Tests/sysbench_results_c7g.4xlarge_20250605_050522.txt
=====================================================================
SYSBENCH COMPREHENSIVE BENCHMARK RESULTS
=====================================================================
Start Time: Thu Jun  5 05:05:22 UTC 2025
Hostname: ip-172-28-34-204.8067.aws-int.thomsonreuters.com
Instance Type: c7g.4xlarge
Operating System: Linux ip-172-28-34-204.8067.aws-int.thomsonreuters.com 6.1.131-143.221.amzn2023.aarch64 #1 SMP Mon Mar 24 15:34:49 UTC 2025 aarch64 aarch64 aarch64 GNU/Linux
CPU Info: AWS Graviton3
CPU Cores: 16
Memory: 30Gi
=====================================================================

[2025-06-05 05:05:22] Starting Sysbench Comprehensive Benchmark Suite
[2025-06-05 05:05:22] Results will be saved to: sysbench_results_c7g.4xlarge_20250605_050522.txt
[2025-06-05 05:05:22] ================================================
[2025-06-05 05:05:22] Checking prerequisites...
[2025-06-05 05:05:22] k6 found - K6 tests will be included
[SUCCESS] Prerequisites check passed
[2025-06-05 05:05:22] Setting up PostgreSQL database and user...
[SUCCESS] PostgreSQL setup completed
[2025-06-05 05:05:22] Starting CPU benchmarks...
[2025-06-05 05:05:22] Detected 16 CPU cores

=====================================================================
SINGLE-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 05:05:22] Running single-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 1 eps: 28508.36 lat (ms,95%): 0.04
[ 20s ] thds: 1 eps: 28512.71 lat (ms,95%): 0.04
[ 30s ] thds: 1 eps: 28504.91 lat (ms,95%): 0.04
[ 40s ] thds: 1 eps: 28517.55 lat (ms,95%): 0.04
[ 50s ] thds: 1 eps: 28521.86 lat (ms,95%): 0.04
[ 60s ] thds: 1 eps: 28511.98 lat (ms,95%): 0.04
[ 70s ] thds: 1 eps: 28513.40 lat (ms,95%): 0.04
[ 80s ] thds: 1 eps: 28512.88 lat (ms,95%): 0.04
[ 90s ] thds: 1 eps: 28519.41 lat (ms,95%): 0.04
[ 100s ] thds: 1 eps: 28526.82 lat (ms,95%): 0.04
[ 110s ] thds: 1 eps: 28526.01 lat (ms,95%): 0.04
CPU speed:
    events per second: 28514.37

Throughput:
    events/s (eps):                      28514.3681
    time elapsed:                        120.0002s
    total number of events:              3421729

Latency (ms):
         min:                                    0.03
         avg:                                    0.03
         max:                                    0.13
         95th percentile:                        0.04
         sum:                               119619.44

Threads fairness:
    events (avg/stddev):           3421729.0000/0.00
    execution time (avg/stddev):   119.6194/0.00

[SUCCESS] Single-core CPU benchmark completed

=====================================================================
MULTI-CORE CPU BENCHMARK (10 minutes)
=====================================================================

[2025-06-05 05:07:22] Running multi-core CPU benchmark (10 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Prime numbers limit: 2000

Initializing worker threads...

Threads started!

[ 10s ] thds: 16 eps: 454628.93 lat (ms,95%): 0.04
[ 20s ] thds: 16 eps: 454613.46 lat (ms,95%): 0.04
[ 30s ] thds: 16 eps: 454657.17 lat (ms,95%): 0.04
[ 40s ] thds: 16 eps: 454382.89 lat (ms,95%): 0.04
[ 50s ] thds: 16 eps: 454863.93 lat (ms,95%): 0.04
[ 60s ] thds: 16 eps: 454811.23 lat (ms,95%): 0.04
[ 70s ] thds: 16 eps: 455049.87 lat (ms,95%): 0.04
[ 80s ] thds: 16 eps: 455013.10 lat (ms,95%): 0.04
[ 90s ] thds: 16 eps: 455034.45 lat (ms,95%): 0.04
[ 100s ] thds: 16 eps: 454331.93 lat (ms,95%): 0.04
[ 110s ] thds: 16 eps: 455054.57 lat (ms,95%): 0.04
CPU speed:
    events per second: 454789.83

Throughput:
    events/s (eps):                      454789.8277
    time elapsed:                        120.0003s
    total number of events:              54574914

Latency (ms):
         min:                                    0.03
         avg:                                    0.04
         max:                                   22.37
         95th percentile:                        0.04
         sum:                              1913900.59

Threads fairness:
    events (avg/stddev):           3410932.1250/18284.51
    execution time (avg/stddev):   119.6188/0.00

[SUCCESS] Multi-core CPU benchmark completed
[2025-06-05 05:09:22] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed
[2025-06-05 05:09:23] Preparing PostgreSQL test data...

=====================================================================
POSTGRESQL DATA PREPARATION
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Creating table 'sbtest1'...
Inserting 1000000 records into 'sbtest1'
Creating a secondary index on 'sbtest1'...
Creating table 'sbtest2'...
Inserting 1000000 records into 'sbtest2'
Creating a secondary index on 'sbtest2'...
Creating table 'sbtest3'...
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest3'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest4'
Creating a secondary index on 'sbtest4'...
Creating table 'sbtest5'...
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest5'...
Creating table 'sbtest6'...
Inserting 1000000 records into 'sbtest6'
Creating a secondary index on 'sbtest6'...
Creating table 'sbtest7'...
Inserting 1000000 records into 'sbtest7'
Creating a secondary index on 'sbtest7'...
Creating table 'sbtest8'...
Inserting 1000000 records into 'sbtest8'
Creating a secondary index on 'sbtest8'...
Creating table 'sbtest9'...
Inserting 1000000 records into 'sbtest9'
Creating a secondary index on 'sbtest9'...
Creating table 'sbtest10'...
Inserting 1000000 records into 'sbtest10'
Creating a secondary index on 'sbtest10'...
[SUCCESS] PostgreSQL test data preparation completed
[2025-06-05 05:11:11] Starting PostgreSQL benchmarks...

=====================================================================
READ-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 05:11:11] Running Read-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 12428.53 qps: 198871.32 (r/w/o: 174012.67/0.00/24858.65) lat (ms,95%): 1.39 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 12643.77 qps: 202302.84 (r/w/o: 177015.31/0.00/25287.53) lat (ms,95%): 1.37 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 12646.63 qps: 202346.59 (r/w/o: 177053.33/0.00/25293.26) lat (ms,95%): 1.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 12670.59 qps: 202722.58 (r/w/o: 177381.40/0.00/25341.17) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 12713.70 qps: 203420.36 (r/w/o: 177993.05/0.00/25427.31) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 12660.75 qps: 202574.86 (r/w/o: 177253.35/0.00/25321.51) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 12614.36 qps: 201828.22 (r/w/o: 176599.51/0.00/25228.72) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 12668.60 qps: 202696.64 (r/w/o: 177359.35/0.00/25337.29) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 12731.40 qps: 203704.95 (r/w/o: 178242.16/0.00/25462.79) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 12729.75 qps: 203672.52 (r/w/o: 178213.02/0.00/25459.50) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 12686.65 qps: 202990.38 (r/w/o: 177617.07/0.00/25373.31) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 12726.20 qps: 203617.01 (r/w/o: 178164.81/0.00/25452.20) lat (ms,95%): 1.34 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            21269276
        write:                           0
        other:                           3038468
        total:                           24307744
    transactions:                        1519234 (12659.83 per sec.)
    queries:                             24307744 (202557.32 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      12659.8323
    time elapsed:                        120.0043s
    total number of events:              1519234

Latency (ms):
         min:                                    0.83
         avg:                                    1.26
         max:                                   59.26
         95th percentile:                        1.34
         sum:                              1918321.10

Threads fairness:
    events (avg/stddev):           94952.1250/987.50
    execution time (avg/stddev):   119.8951/0.00

[SUCCESS] Read-Only benchmark completed

=====================================================================
WRITE-ONLY BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 05:13:11] Running Write-Only benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 1214.39 qps: 7294.35 (r/w/o: 0.00/4863.96/2430.38) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1283.20 qps: 7699.22 (r/w/o: 0.00/5132.81/2566.41) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 489.60 qps: 2937.60 (r/w/o: 0.00/1958.40/979.20) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1271.60 qps: 7629.60 (r/w/o: 0.00/5086.40/2543.20) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 492.80 qps: 2956.80 (r/w/o: 0.00/1971.20/985.60) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 1288.40 qps: 7730.40 (r/w/o: 0.00/5153.60/2576.80) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 480.00 qps: 2880.00 (r/w/o: 0.00/1920.00/960.00) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 1307.20 qps: 7843.21 (r/w/o: 0.00/5228.81/2614.40) lat (ms,95%): 36.89 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 489.60 qps: 2937.60 (r/w/o: 0.00/1958.40/979.20) lat (ms,95%): 41.85 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 1255.50 qps: 7532.99 (r/w/o: 0.00/5022.00/2511.00) lat (ms,95%): 37.56 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 540.80 qps: 3244.80 (r/w/o: 0.00/2163.20/1081.60) lat (ms,95%): 41.10 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 1094.90 qps: 6569.40 (r/w/o: 0.00/4379.60/2189.80) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           448388
        other:                           224194
        total:                           672582
    transactions:                        112097 (933.50 per sec.)
    queries:                             672582 (5600.98 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      933.4959
    time elapsed:                        120.0830s
    total number of events:              112097

Latency (ms):
         min:                                    2.25
         avg:                                   17.14
         max:                                  199.52
         95th percentile:                       38.94
         sum:                              1921121.84

Threads fairness:
    events (avg/stddev):           7006.0625/0.24
    execution time (avg/stddev):   120.0701/0.00

[SUCCESS] Write-Only benchmark completed

=====================================================================
READ-WRITE BENCHMARK (2 minutes)
=====================================================================

[2025-06-05 05:15:12] Running Read-Write benchmark (2 minutes)...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 295.27 qps: 5935.76 (r/w/o: 4156.15/1187.47/592.14) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 356.81 qps: 7136.14 (r/w/o: 4995.30/1427.23/713.61) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 506.20 qps: 10123.97 (r/w/o: 7086.78/2024.79/1012.40) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 398.40 qps: 7968.00 (r/w/o: 5577.60/1593.60/796.80) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 533.30 qps: 10666.04 (r/w/o: 7466.22/2133.21/1066.60) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 722.60 qps: 14451.99 (r/w/o: 10116.40/2890.40/1445.20) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 16 tps: 491.80 qps: 9836.00 (r/w/o: 6885.20/1967.20/983.60) lat (ms,95%): 46.63 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 16 tps: 910.50 qps: 18210.00 (r/w/o: 12747.00/3642.00/1821.00) lat (ms,95%): 38.25 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 16 tps: 549.40 qps: 10985.80 (r/w/o: 7691.60/2195.40/1098.80) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 16 tps: 475.20 qps: 9506.20 (r/w/o: 6652.80/1903.00/950.40) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 16 tps: 1067.00 qps: 21339.99 (r/w/o: 14938.00/4268.00/2134.00) lat (ms,95%): 42.61 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 16 tps: 462.30 qps: 9246.00 (r/w/o: 6472.20/1849.20/924.60) lat (ms,95%): 43.39 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            947856
        write:                           270816
        other:                           135408
        total:                           1354080
    transactions:                        67704  (564.10 per sec.)
    queries:                             1354080 (11282.05 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      564.1023
    time elapsed:                        120.0208s
    total number of events:              67704

Latency (ms):
         min:                                    1.93
         avg:                                   28.36
         max:                                  260.85
         95th percentile:                      137.35
         sum:                              1920100.09

Threads fairness:
    events (avg/stddev):           4231.5000/5.32
    execution time (avg/stddev):   120.0063/0.01

[SUCCESS] Read-Write benchmark completed

=====================================================================
OLTP POINT SELECT BENCHMARK
=====================================================================

[2025-06-05 05:17:12] Running OLTP Point Select benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            2521827
        write:                           0
        other:                           0
        total:                           2521827
    transactions:                        2521827 (251937.90 per sec.)
    queries:                             2521827 (251937.90 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      251937.8951
    time elapsed:                        10.0097s
    total number of events:              2521827

Latency (ms):
         min:                                    0.02
         avg:                                    0.06
         max:                                  163.03
         95th percentile:                        0.10
         sum:                               159404.26

Threads fairness:
    events (avg/stddev):           157614.1875/1868.10
    execution time (avg/stddev):   9.9628/0.00

[SUCCESS] OLTP Point Select benchmark completed

=====================================================================
OLTP UPDATE INDEX BENCHMARK
=====================================================================

[2025-06-05 05:17:22] Running OLTP Update Index benchmark...
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            0
        write:                           31701
        other:                           0
        total:                           31701
    transactions:                        31701  (3164.15 per sec.)
    queries:                             31701  (3164.15 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3164.1530
    time elapsed:                        10.0188s
    total number of events:              31701

Latency (ms):
         min:                                    1.29
         avg:                                    5.05
         max:                                  168.71
         95th percentile:                       18.61
         sum:                               160140.65

Threads fairness:
    events (avg/stddev):           1981.3125/0.46
    execution time (avg/stddev):   10.0088/0.00

[SUCCESS] OLTP Update Index benchmark completed
[2025-06-05 05:17:32] Starting K6 benchmarks...
[2025-06-05 05:17:32] Truncating cache table...
TRUNCATE TABLE
[SUCCESS] Cache table truncated

=====================================================================
K6 AOT INSERT TEST
=====================================================================

[2025-06-05 05:17:32] Running K6 AOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 23802 complete and 0 interrupted iterations
default   [  24% ] 80 VUs  00m01.0s/10m0s  023802/100000 shared iters

running (00m02.0s), 80/80 VUs, 54363 complete and 0 interrupted iterations
default   [  54% ] 80 VUs  00m02.0s/10m0s  054364/100000 shared iters

running (00m03.0s), 80/80 VUs, 84575 complete and 0 interrupted iterations
default   [  85% ] 80 VUs  00m03.0s/10m0s  084575/100000 shared iters
time="2025-06-05T05:17:36Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=4.69ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  28263.964892/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=2.59ms min=248.47µs med=2.19ms max=190.27ms p(90)=3.86ms p(95)=4.69ms
      { endpoint:postgres_insert }..............................................: avg=2.59ms min=248.47µs med=2.19ms max=190.27ms p(90)=3.86ms p(95)=4.69ms
      { expected_response:true }................................................: avg=2.59ms min=248.47µs med=2.19ms max=190.27ms p(90)=3.86ms p(95)=4.69ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 28264.247532/s

    EXECUTION
    iteration_duration..........................................................: avg=2.78ms min=312.31µs med=2.3ms  max=191.37ms p(90)=4.31ms p(95)=5.34ms
    iterations..................................................................: 100000 28263.964892/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 2.6 MB/s
    data_sent...................................................................: 26 MB  7.3 MB/s



running (00m03.5s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m03.5s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Insert test completed

=====================================================================
K6 AOT QUERY TEST
=====================================================================

[2025-06-05 05:17:36] Running K6 AOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/aot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T05:17:36Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T05:17:36Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 30076 complete and 0 interrupted iterations
default   [  30% ] 80 VUs  00m01.0s/10m0s  030076/100000 shared iters

running (00m02.0s), 80/80 VUs, 63391 complete and 0 interrupted iterations
default   [  63% ] 80 VUs  00m02.0s/10m0s  063392/100000 shared iters

running (00m03.0s), 80/80 VUs, 96993 complete and 0 interrupted iterations
default   [  97% ] 80 VUs  00m03.0s/10m0s  096993/100000 shared iters
time="2025-06-05T05:17:39Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T05:17:39Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=4.22ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  97170.058002/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=2.24ms min=253.03µs med=2.04ms max=12.78ms p(90)=3.42ms p(95)=4.22ms
      { endpoint:postgres_get }.............................................: avg=2.25ms min=253.03µs med=2.04ms max=12.78ms p(90)=3.42ms p(95)=4.22ms
      { expected_response:true }............................................: avg=2.24ms min=253.03µs med=2.04ms max=12.78ms p(90)=3.42ms p(95)=4.22ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 32422.733253/s

    EXECUTION
    iteration_duration......................................................: avg=2.41ms min=316.05µs med=2.15ms max=13.32ms p(90)=3.75ms p(95)=4.72ms
    iterations..............................................................: 100000 32390.019334/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  6.9 MB/s
    data_sent...............................................................: 13 MB  4.2 MB/s



running (00m03.1s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m03.0s/10m0s  100000/100000 shared iters
[SUCCESS] K6 AOT Query test completed

=====================================================================
K6 NAOT INSERT TEST
=====================================================================

[2025-06-05 05:17:39] Running K6 NAOT Insert test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/insert-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 80/80 VUs, 12576 complete and 0 interrupted iterations
default   [  13% ] 80 VUs  00m01.0s/10m0s  012576/100000 shared iters

running (00m02.0s), 80/80 VUs, 34422 complete and 0 interrupted iterations
default   [  34% ] 80 VUs  00m02.0s/10m0s  034423/100000 shared iters

running (00m03.0s), 80/80 VUs, 56582 complete and 0 interrupted iterations
default   [  57% ] 80 VUs  00m03.0s/10m0s  056582/100000 shared iters

running (00m04.0s), 80/80 VUs, 82451 complete and 0 interrupted iterations
default   [  82% ] 80 VUs  00m04.0s/10m0s  082451/100000 shared iters
time="2025-06-05T05:17:44Z" level=info msg="INFO: Insert test finished." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_insert}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_insert}
    ✓ 'p(95)<300' p(95)=5.99ms

    http_req_failed{endpoint:postgres_insert}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 100000  21677.191653/s
    checks_succeeded...................: 100.00% 100000 out of 100000
    checks_failed......................: 0.00%   0 out of 100000

    ✓ Postgres: insert status is 200

    HTTP
    http_req_duration...........................................................: avg=3.45ms min=337.64µs med=2.86ms max=390.05ms p(90)=4.92ms p(95)=5.99ms
      { endpoint:postgres_insert }..............................................: avg=3.45ms min=337.64µs med=2.86ms max=390.05ms p(90)=4.92ms p(95)=5.99ms
      { expected_response:true }................................................: avg=3.45ms min=337.64µs med=2.86ms max=390.05ms p(90)=4.92ms p(95)=5.99ms
    http_req_failed.............................................................: 0.00%  0 out of 100001
      { endpoint:postgres_insert }..............................................: 0.00%  0 out of 100000
    http_reqs...................................................................: 100001 21677.408425/s

    EXECUTION
    iteration_duration..........................................................: avg=3.64ms min=396.44µs med=2.98ms max=390.94ms p(90)=5.37ms p(95)=6.65ms
    iterations..................................................................: 100000 21677.191653/s
    vus.........................................................................: 80     min=80          max=80
    vus_max.....................................................................: 80     min=80          max=80

    NETWORK
    data_received...............................................................: 9.2 MB 2.0 MB/s
    data_sent...................................................................: 26 MB  5.6 MB/s



running (00m04.6s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m04.6s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Insert test completed

=====================================================================
K6 NAOT QUERY TEST
=====================================================================

[2025-06-05 05:17:44] Running K6 NAOT Query test...

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: ./k6/naot/query-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 80 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 100000 iterations shared among 80 VUs (maxDuration: 10m0s, gracefulStop: 30s)

time="2025-06-05T05:17:44Z" level=info msg="INFO: Setting up 100 keys for query test..." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup progress... 10/100 keys inserted." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup progress... 20/100 keys inserted." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup progress... 30/100 keys inserted." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup progress... 40/100 keys inserted." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup progress... 50/100 keys inserted." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup progress... 60/100 keys inserted." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup progress... 70/100 keys inserted." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup progress... 80/100 keys inserted." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup progress... 90/100 keys inserted." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup progress... 100/100 keys inserted." source=console
time="2025-06-05T05:17:44Z" level=info msg="INFO: Setup complete. 100 keys available for querying." source=console

running (00m01.0s), 80/80 VUs, 26577 complete and 0 interrupted iterations
default   [  27% ] 80 VUs  00m01.0s/10m0s  026577/100000 shared iters

running (00m02.0s), 80/80 VUs, 58157 complete and 0 interrupted iterations
default   [  58% ] 80 VUs  00m02.0s/10m0s  058157/100000 shared iters

running (00m03.0s), 80/80 VUs, 91062 complete and 0 interrupted iterations
default   [  91% ] 80 VUs  00m03.0s/10m0s  091062/100000 shared iters
time="2025-06-05T05:17:47Z" level=info msg="INFO: Query test finished. Tested with 100 keys." source=console
time="2025-06-05T05:17:47Z" level=info msg="INFO: Teardown cleanup finished." source=console


  █ THRESHOLDS 

    checks{endpoint:postgres_get}
    ✓ 'rate>0.99' rate=100.00%

    http_req_duration{endpoint:postgres_get}
    ✓ 'p(95)<300' p(95)=4.42ms

    http_req_failed{endpoint:postgres_get}
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......................: 300000  91797.395669/s
    checks_succeeded...................: 100.00% 300000 out of 300000
    checks_failed......................: 0.00%   0 out of 300000

    ✓ Postgres: get status is 200
    ✓ Postgres: get response has valid status
    ✓ Postgres: get response is valid JSON

    HTTP
    http_req_duration.......................................................: avg=2.37ms min=230.73µs med=2.12ms max=37.96ms p(90)=3.74ms p(95)=4.41ms
      { endpoint:postgres_get }.............................................: avg=2.38ms min=230.73µs med=2.13ms max=37.96ms p(90)=3.74ms p(95)=4.42ms
      { expected_response:true }............................................: avg=2.37ms min=230.73µs med=2.12ms max=37.96ms p(90)=3.74ms p(95)=4.41ms
    http_req_failed.........................................................: 0.00%  0 out of 100101
      { endpoint:postgres_get }.............................................: 0.00%  0 out of 100000
    http_reqs...............................................................: 100101 30630.037013/s

    EXECUTION
    iteration_duration......................................................: avg=2.55ms min=293.27µs med=2.24ms max=38.04ms p(90)=4.05ms p(95)=4.85ms
    iterations..............................................................: 100000 30599.13189/s
    vus.....................................................................: 80     min=80          max=80
    vus_max.................................................................: 80     min=80          max=80

    NETWORK
    data_received...........................................................: 21 MB  6.5 MB/s
    data_sent...............................................................: 13 MB  3.9 MB/s



running (00m03.3s), 00/80 VUs, 100000 complete and 0 interrupted iterations
default ✓ [ 100% ] 80 VUs  00m03.2s/10m0s  100000/100000 shared iters
[SUCCESS] K6 NAOT Query test completed
[SUCCESS] All available K6 benchmarks completed
[2025-06-05 05:17:47] Cleaning up PostgreSQL test data...

=====================================================================
POSTGRESQL CLEANUP
=====================================================================

sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...
Dropping table 'sbtest9'...
Dropping table 'sbtest10'...
[SUCCESS] PostgreSQL cleanup completed

=====================================================================
BENCHMARK COMPLETION
=====================================================================
End Time: Thu Jun  5 05:17:47 UTC 2025
Duration: 12 minutes and 25 seconds
Results saved to: sysbench_results_c7g.4xlarge_20250605_050522.txt
=====================================================================
[2025-06-05 05:17:47] ================================================
[SUCCESS] All benchmarks completed successfully!
[2025-06-05 05:17:47] Detailed results saved to: sysbench_results_c7g.4xlarge_20250605_050522.txt